# 19572

# 가뭄에 찌든 신촌을 위해서 국렬이는 세 칸으로 구성 되어있는 신촌에 비를 내릴 것이다
# 그러나 국렬이는 무능해서 각 칸마다 비를 내리지 못하고 두 칸에 동일하게 비를 내리는 것만 할 수 있다
# 1번째 칸, 2번째 칸에 동시에 뿌리는 비의 강수량을 a cm,
# 1번째 칸, 3번째 칸에 동시에 뿌리는 비의 강수량을 b cm,
# 2번째 칸, 3번째 칸에 동시에 뿌리는 비의 강수량을 c cm이라고 하자. a, b, c는 모두 양의 실수여야 한다
# 가뭄에 찌든 신촌이라도 비가 너무 많이 오면 상당히 곤란하고 비가 너무 조금 와도 곤란하다
# 그래서 각 칸에 해당하는 지역은 강수량이 정확히 di cm가 되어야 한다
# 이때 정확한 a, b, c의 값을 구하라

# 3개의 양의 정수가 입력으로 들어온다
# 각각 d1, d2, d3을 의미한다

# 조건에 맞게 비를 내릴 수 없다면 -1을 출력
# 조건에 맞게 비를 내릴 수 있다면 1을 출력하고
# 다음 줄에 a, b, c를 소수 첫째 자리까지 반올림한 것을 공백으로 구분하여 출력

d1, d2, d3 = map(int, input().split())
# 두 값의 합에서 d3를 뺀 값의 절반으로 계산
a = (d1 + d2 - d3) / 2
b = d1 - a
c = d2 - a
if a > 0 and b > 0 and c > 0:
    print(1, '%.1f %.1f %.1f' %(a, b, c), sep='\n')
else:
    print(-1)